app/views/users/show.html.erb

 		<%= render 'follow_form' if signed_in? %>
 		<% if @user.microposts.any? %>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 103