app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "10"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 103 ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 103
---
  def show
  	@user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

INSERT INTO "users" ("admin", "created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
  	@user = User.new(params[:user])
  	if @user.save

UPDATE "users" SET "password_digest" = '$2a$10$TEDYA3XpLOOXWgKUDoMSvuBbPJ1BgPDIEHmRYYyJzDq7puLbApxXS', "remember_token" = 'S0VqOqknLgYWjoOulw4PBg', "updated_at" = '2012-07-28 20:45:51.957031' WHERE "users"."id" = 154
---
  def update
    #@user = User.find(params[:id])
    if @user.update_attributes(params[:user])